# QF 627 Programming and Computational Finance
## Problem-Sets for Exercise `3` | `Questions`

> "Hi Team! ðŸ‘‹

> Here we go again! The current script is prepared to help you to further exercise course content (But, again, do note that these are not assessment questions. They are for your exercise.)

> Some of the questions ask you to perform `reverse-engineering` ðŸ§©. Instead of a question written in text format, you will be given the end results of some lines of code. Your task is to fill in the input cell with lines of code to create the output cell. Such a reverse-engineering exercise in computational programming will maximize your knowledge and skills in Computational Finance. 

> The questions below wonâ€™t be that difficult, as you have learned how to answer them from the lessons and the assigned readings. As you will notice from the questions, my intention is not just to give questions, but also to give additional learning pointers. I hope this helps ðŸ˜Š

> Enjoy!

##### First, let's do some quick exercise with stock prices data.

### <font color = green> Activation of necessary libraries. </font>

In [2]:
import matplotlib as mpl
mpl.__version__

'3.9.2'

In [3]:
import numpy as np
np.__version__

'2.1.1'

In [4]:
import matplotlib.pyplot as plt
import pandas as pd
import datetime

### Let's try to import historical stock data from the web and from your machine.

#### How to import from the Web

> You may use `yfinance` library.

In [5]:
!pip install yfinance

Requirement already satisfied: yfinance in /Users/lu/myenv/lib/python3.11/site-packages (0.2.38)
Requirement already satisfied: pandas>=1.3.0 in /Users/lu/myenv/lib/python3.11/site-packages (from yfinance) (2.2.2)
Requirement already satisfied: numpy>=1.16.5 in /Users/lu/myenv/lib/python3.11/site-packages (from yfinance) (2.1.1)
Requirement already satisfied: requests>=2.31 in /Users/lu/myenv/lib/python3.11/site-packages (from yfinance) (2.32.3)
Requirement already satisfied: multitasking>=0.0.7 in /Users/lu/myenv/lib/python3.11/site-packages (from yfinance) (0.0.11)
Requirement already satisfied: lxml>=4.9.1 in /Users/lu/myenv/lib/python3.11/site-packages (from yfinance) (5.3.0)
Requirement already satisfied: appdirs>=1.4.4 in /Users/lu/myenv/lib/python3.11/site-packages (from yfinance) (1.4.4)
Requirement already satisfied: pytz>=2022.5 in /Users/lu/myenv/lib/python3.11/site-packages (from yfinance) (2024.2)
Requirement already satisfied: frozendict>=2.3.4 in /Users/lu/myenv/lib/python3.11/site-packages (from yfinance) (2.4.4)
Requirement already satisfied: peewee>=3.16.2 in /Users/lu/myenv/lib/python3.11/site-packages (from yfinance) (3.17.6)
Requirement already satisfied: beautifulsoup4>=4.11.1 in /Users/lu/myenv/lib/python3.11/site-packages (from yfinance) (4.12.3)
Requirement already satisfied: html5lib>=1.1 in /Users/lu/myenv/lib/python3.11/site-packages (from yfinance) (1.1)
Requirement already satisfied: soupsieve>1.2 in /Users/lu/myenv/lib/python3.11/site-packages (from beautifulsoup4>=4.11.1->yfinance) (2.6)
Requirement already satisfied: six>=1.9 in /Users/lu/myenv/lib/python3.11/site-packages (from html5lib>=1.1->yfinance) (1.16.0)
Requirement already satisfied: webencodings in /Users/lu/myenv/lib/python3.11/site-packages (from html5lib>=1.1->yfinance) (0.5.1)
Requirement already satisfied: python-dateutil>=2.8.2 in /Users/lu/myenv/lib/python3.11/site-packages (from pandas>=1.3.0->yfinance) (2.9.0.post0)
Requirement already satisfied: tzdata>=2022.7 in /Users/lu/myenv/lib/python3.11/site-packages (from pandas>=1.3.0->yfinance) (2024.1)
Requirement already satisfied: charset-normalizer<4,>=2 in /Users/lu/myenv/lib/python3.11/site-packages (from requests>=2.31->yfinance) (3.3.2)
Requirement already satisfied: idna<4,>=2.5 in /Users/lu/myenv/lib/python3.11/site-packages (from requests>=2.31->yfinance) (3.10)
Requirement already satisfied: urllib3<3,>=1.21.1 in /Users/lu/myenv/lib/python3.11/site-packages (from requests>=2.31->yfinance) (2.2.3)
Requirement already satisfied: certifi>=2017.4.17 in /Users/lu/myenv/lib/python3.11/site-packages (from requests>=2.31->yfinance) (2024.8.30)

In [6]:
import yfinance as yf

> Let's start & end dates--we are interested in year 2021 until August.

In [7]:
start = datetime.datetime(2024, 1, 1)
end = datetime.datetime(2024, 8, 31)

> Then, let's use [Yahoo! Finance](https://sg.finance.yahoo.com/) for extracting æå– historical stock data.

In [8]:
apple =\
(    yf
     .download("AAPL",
               start,
               end)
)

google =\
(    yf
     .download("GOOGL", 
               start,
               end)
)

[*********************100%%**********************]  1 of 1 completed
[*********************100%%**********************]  1 of 1 completed

> You may save the data to csv files.

In [9]:
apple.to_csv("apple_2024_stock.csv")
google.to_csv("google_2024_stock.csv")

#### Have a quick look at your data.

In [10]:
apple.head()

,Open,High,Low,Close,Adj Close,Volume
Date,,,,,,
2024-01-02,187.149994,188.440002,183.889999,185.639999,184.938217,82488700
2024-01-03,184.220001,185.880005,183.429993,184.250000,183.553482,58414500
2024-01-04,182.149994,183.089996,180.880005,181.910004,181.222336,71983600
2024-01-05,181.990005,182.759995,180.169998,181.179993,180.495071,62303300
2024-01-08,182.089996,185.600006,181.500000,185.559998,184.858521,59144500

In [11]:
google.head()

,Open,High,Low,Close,Adj Close,Volume
Date,,,,,,
2024-01-02,138.550003,139.449997,136.479996,138.169998,137.828705,23711200
2024-01-03,137.250000,139.630005,137.080002,138.919998,138.576859,24212100
2024-01-04,138.419998,139.160004,136.350006,136.389999,136.053116,27137700
2024-01-05,136.750000,137.160004,135.149994,135.729996,135.394730,22506000
2024-01-08,136.289993,139.009995,136.259995,138.839996,138.497055,21404000

In [12]:
apple.describe()

,Open,High,Low,Close,Adj Close,Volume
count,168.000000,168.000000,168.000000,168.000000,168.000000,1.680000e+02
mean,194.252380,196.172500,192.514821,194.389583,194.020256,6.168830e+07
std,20.554547,20.896348,20.132660,20.590587,20.712093,2.820863e+07
min,165.350006,166.399994,164.080002,165.000000,164.585999,3.029900e+07
25%,176.825001,178.592499,174.869999,178.139999,177.693039,4.596918e+07
50%,188.735001,190.285004,187.360001,188.740005,188.146545,5.353515e+07
75%,214.119995,216.962498,211.932499,214.252502,214.004791,6.862602e+07
max,236.479996,237.229996,233.089996,234.820007,234.548523,2.464214e+08

In [13]:
google.describe()

,Open,High,Low,Close,Adj Close,Volume
count,168.000000,168.000000,168.000000,168.000000,168.000000,1.680000e+02
mean,160.070476,161.745238,158.608928,160.225476,159.898376,2.762492e+07
std,15.661862,15.742355,15.547389,15.605793,15.629486,1.091537e+07
min,131.880005,133.240005,130.669998,131.399994,131.075424,1.024210e+07
25%,145.875000,146.632500,144.920006,145.977505,145.616924,2.103315e+07
50%,160.504997,163.440002,158.764999,160.834999,160.621857,2.448235e+07
75%,174.189995,175.357502,172.090000,173.610001,173.181187,3.117152e+07
max,190.309998,191.750000,189.029999,191.179993,190.926636,7.191000e+07

### We will `re-organize` and `re-shape` stock data

> Let's concatenate data in multiple DataFrame objects

> Let's obtain Apple adjusted close data for July and August 2021

In [14]:
apple_July = apple.loc["2024-07", 'Adj Close']

apple_July.to_frame().head()

             Adj Close
Date
2024-07-01  216.499405
2024-07-02  220.015335
2024-07-03  221.293854
2024-07-05  226.078308
2024-07-08  227.556610

In [15]:
apple_Aug = apple.loc["2024-08", 'Adj Close']

apple_Aug.to_frame().head()

             Adj Close
Date
2024-08-01  218.107544
2024-08-02  219.605804
2024-08-05  209.028061
2024-08-06  206.990402
2024-08-07  209.577423

### Question 1-1. Please combine the first three rows of each of `apple_07` and `apple_08`

In [16]:
combined_07_08 = pd.concat([apple_July.to_frame().head(3), apple_Aug.to_frame().head(3)])
combined_07_08

             Adj Close
Date
2024-07-01  216.499405
2024-07-02  220.015335
2024-07-03  221.293854
2024-08-01  218.107544
2024-08-02  219.605804
2024-08-05  209.028061

#### Question 1-2. How would you extract only the 2021 August GOOGL values?

In [17]:
google_Aug = google.loc['2024-08', 'Adj Close']
google_Aug.to_frame()

             Adj Close
Date
2024-08-01  170.533707
2024-08-02  166.439148
2024-08-05  159.038971
2024-08-06  158.080231
2024-08-07  158.729370
2024-08-08  161.815277
2024-08-09  163.453110
2024-08-12  162.074921
2024-08-13  163.942459
2024-08-14  160.157471
2024-08-15  161.086243
2024-08-16  162.744049
2024-08-19  166.449127
2024-08-20  166.958450
2024-08-21  165.630219
2024-08-22  163.582932
2024-08-23  165.400513
2024-08-26  165.939804
2024-08-27  164.461761
2024-08-28  162.634201
2024-08-29  161.565613
2024-08-30  163.163498

#### Question 1-3. Please concatenate the AAPL and GOOGL 2021 August stock data--there will be duplicate index labels

In [18]:
apple_google_Aug = pd.concat([apple_Aug.head(3), google_Aug.head(3)], axis=0)
apple_google_Aug.to_frame()

             Adj Close
Date
2024-08-01  218.107544
2024-08-02  219.605804
2024-08-05  209.028061
2024-08-01  170.533707
2024-08-02  166.439148
2024-08-05  159.038971

> Let's see the `two records for data of 2024-08-02`

In [19]:
apple_google_Aug_02 = apple_google_Aug.loc['2024-08-02'].to_frame()
apple_google_Aug_02

             Adj Close
Date
2024-08-02  219.605804
2024-08-02  166.439148

#### Question 1-4. Please concatenate to show a specification of the stock tickets being part of the index. This will help disambiguate the duplicate dates using a hierarchal index.

In [20]:
df_together = pd.concat([apple_Aug.head(3), google_Aug.head(3)], keys = ["APPLE","GOOGLE"])
df_together.to_frame()

                    Adj Close
       Date
APPLE  2024-08-01  218.107544
       2024-08-02  219.605804
       2024-08-05  209.028061
GOOGLE 2024-08-01  170.533707
       2024-08-02  166.439148
       2024-08-05  159.038971

> Let's extract just GOOGL values using `.loc`

In [21]:
just_google = df_together.loc["GOOGLE"]
just_google.to_frame()

             Adj Close
Date
2024-08-01  170.533707
2024-08-02  166.439148
2024-08-05  159.038971

#### Question 1-5. Let's show concatenation using two DataFrame's that each have two columns.  `pandas` will align the data in columns by the column names (labels)

In [22]:
all_apple = apple.loc[:,["Adj Close", "Volume"]] #loc[row,[cloumn]]å‡ºæ¥çš„å°±æ˜¯df
all_google = google.loc[:, ["Adj Close", "Volume"]]

two_df = pd.concat([all_apple, all_google])
two_df

             Adj Close    Volume
Date
2024-01-02  184.938217  82488700
2024-01-03  183.553482  58414500
2024-01-04  181.222336  71983600
2024-01-05  180.495071  62303300
2024-01-08  184.858521  59144500
...                ...       ...
2024-08-26  165.939804  14190400
2024-08-27  164.461761  11821900
2024-08-28  162.634201  16407400
2024-08-29  161.565613  19699800
2024-08-30  163.163498  22123800

[336 rows x 2 columns]

> Let's see concatenation with DataFrame objects that do not have the same set of columns.

> This will show pandas filling in NaN values.

In [23]:
all_google_1 = google.loc[:, ["Adj Close"]] # only "adj" for Google, without "volume"
two_df_nan = pd.concat([all_apple, all_google_1]) 
two_df_nan

             Adj Close      Volume
Date
2024-01-02  184.938217  82488700.0
2024-01-03  183.553482  58414500.0
2024-01-04  181.222336  71983600.0
2024-01-05  180.495071  62303300.0
2024-01-08  184.858521  59144500.0
...                ...         ...
2024-08-26  165.939804         NaN
2024-08-27  164.461761         NaN
2024-08-28  162.634201         NaN
2024-08-29  161.565613         NaN
2024-08-30  163.163498         NaN

[336 rows x 2 columns]

### Question 2-1. Please perform an inner join on the DataFrame's since `google_a` does not have a Volume column, pandas will not include that column in the result.

In [24]:
all_apple = apple.loc[:,["Adj Close"]] #loc[row,[cloumn]]å‡ºæ¥çš„å°±æ˜¯df
all_google = google.loc[:, ["Adj Close"]]
two_df = pd.concat([all_apple, all_google])
two_df

             Adj Close
Date
2024-01-02  184.938217
2024-01-03  183.553482
2024-01-04  181.222336
2024-01-05  180.495071
2024-01-08  184.858521
...                ...
2024-08-26  165.939804
2024-08-27  164.461761
2024-08-28  162.634201
2024-08-29  161.565613
2024-08-30  163.163498

[336 rows x 1 columns]

#### Question 2-2. Then, please concatenate along the rows, causing duplicate columns to be created in the result.

In [25]:
all_apple = apple.loc[:,["Adj Close"]]
all_google = google.loc[:, ["Adj Close"]]
all = pd.concat([all_apple, all_google],axis = 1)
all

             Adj Close   Adj Close
Date
2024-01-02  184.938217  137.828705
2024-01-03  183.553482  138.576859
2024-01-04  181.222336  136.053116
2024-01-05  180.495071  135.394730
2024-01-08  184.858521  138.497055
...                ...         ...
2024-08-26  227.179993  165.939804
2024-08-27  228.029999  164.461761
2024-08-28  226.490005  162.634201
2024-08-29  229.789993  161.565613
2024-08-30  229.000000  163.163498

[168 rows x 2 columns]

#### Question 2-3. Let's concat along rows using two DataFrame objects with different number of rows. 

#### This demonstrates how NaN values will be filled in those rows for `apple` which only has three rows as compared to 5 for `google`

In [26]:
################## need to modifity
all_apple = apple.loc[:,["Adj Close", "Volume"]] #loc[row,[cloumn]]å‡ºæ¥çš„å°±æ˜¯df
all_google = google.loc[:, ["Adj Close", "Volume"]]# google[["Adj Close, Volume"]]
two_df = pd.concat([all_apple, all_google], axis = 1, keys = ["AAPL", "GOOGL"]).head(5)
two_df

                  AAPL                 GOOGL
             Adj Close    Volume   Adj Close    Volume
Date
2024-01-02  184.938217  82488700  137.828705  23711200
2024-01-03  183.553482  58414500  138.576859  24212100
2024-01-04  181.222336  71983600  136.053116  27137700
2024-01-05  180.495071  62303300  135.394730  22506000
2024-01-08  184.858521  59144500  138.497055  21404000

#### Question 2-4. You know that `inner join` can also be used `along this axis`. 

#### Please include rows with index labels that do not exist in both DataFrame objects

In [27]:
two_df = pd.concat([all_apple, all_google], axis=1).head(3)
two_df

             Adj Close    Volume   Adj Close    Volume
Date
2024-01-02  184.938217  82488700  137.828705  23711200
2024-01-03  183.553482  58414500  138.576859  24212100
2024-01-04  181.222336  71983600  136.053116  27137700

#### Question 2-5. Please ignore indexes and just concatenate the data and have the result have a default integer index

In [27]:
all_apple = apple[["Adj Close"]].head(3)
all_google = google[["Adj Close"]].head(3)
two_df = pd.concat([all_apple, all_google]).reset_index().drop(["Date"], axis = 1)
two_df
# (
#     pd
#     .concat(
#         [apple_5["Adj Close"]].head(3),
#          google_3[["Adj Close"]]
#         ],
#         join = "inner",
#         ignore_index = True
#     )
# )

    Adj Close
0  184.938217
1  183.553482
2  181.222336
3  137.828705
4  138.576859
5  136.053101

### `Now let's merging DataFrame objects`

In [28]:
all_apple = \
    apple\
    [["Adj Close"]]\
    .reset_index() #loc[row,[cloumn]]å‡ºæ¥çš„å°±æ˜¯df

all_apple

#apple_price.reset_index()

          Date   Adj Close
0   2024-01-02  184.938217
1   2024-01-03  183.553482
2   2024-01-04  181.222336
3   2024-01-05  180.495071
4   2024-01-08  184.858521
..         ...         ...
163 2024-08-26  227.179993
164 2024-08-27  228.029999
165 2024-08-28  226.490005
166 2024-08-29  229.789993
167 2024-08-30  229.000000

[168 rows x 2 columns]

### Question 3-1. Please merge the two DataFrame objects, so lets peek at the data to remind ourselves of what they contain.

###  `pandas` finds the columns in common, in this case Date, and merges on that column and adds a column for all the other columns in both DataFrames.

In [29]:
df_31 = \
    pd\
    .merge(apple[["Adj Close"]], \
           apple[["Volume"]], \
           left_index=True, \
           right_index=True) \
    .head(5)\
    .reset_index()

df_31

# apple_price_5 =\
#     apple_price\
#     .head(5)
# apple_volume =\
#     apple\
#     [["Volume"]]\
#     .reset_index()\
#     .head(5)

        Date   Adj Close    Volume
0 2024-01-02  184.938217  82488700
1 2024-01-03  183.553482  58414500
2 2024-01-04  181.222336  71983600
3 2024-01-05  180.495071  62303300
4 2024-01-08  184.858521  59144500

#### Question 3-2. Please use the merge function to create the below.

In [ ]:
# (
#     apple_price_5
#     .merge(apple_volume_5.iloc[2:4],
#           on = "Date")
# )

In [30]:
df_32 =\
    df_31\
    .iloc[[2, 3]]\
    .reset_index\
    (drop=True)

df_32

        Date   Adj Close    Volume
0 2024-01-04  181.222336  71983600
1 2024-01-05  180.495071  62303300

#### Question 3-3. How would you create the below then?

In [ ]:
# merged_with_on_how =\
# (
#     apple_price_5
#     .merge(apple_volume_5.iloc[2:4],
#           on = "Date",
#           how = "left")
# )
# merged_with_on_how

In [31]:
df_33 = two_df_nan.head(5).reset_index()
df_33.loc[[0, 1, 4], "Volume"] = np.nan
df_33

        Date   Adj Close      Volume
0 2024-01-02  184.938217         NaN
1 2024-01-03  183.553482         NaN
2 2024-01-04  181.222336  71983600.0
3 2024-01-05  180.495071  62303300.0
4 2024-01-08  184.858521         NaN

### Let's do some `pivoting`

### Question 4-1. Please insert `Symbol` column before combining

In [ ]:
# apple["Symbol"] == "AAPL"
# google["Symbol"] == "GOOGL"

In [32]:
import sys

In [33]:
apple_41 = pd.DataFrame(apple)
apple_41["Symbol"] = "AAPL"

google_41 = pd.DataFrame(google)
google_41["Symbol"] = "GOOGL"


apple_41 = apple_41[['Symbol', 'Open', 'High', 'Low', 'Close', 'Adj Close', 'Volume']]
google_41 = google_41[['Symbol', 'Open', 'High', 'Low', 'Close', 'Adj Close', 'Volume']]
print(apple_41)
print(google_41)

           Symbol        Open        High         Low       Close   Adj Close  \
Date
2024-01-02   AAPL  187.149994  188.440002  183.889999  185.639999  184.938217
2024-01-03   AAPL  184.220001  185.880005  183.429993  184.250000  183.553482
2024-01-04   AAPL  182.149994  183.089996  180.880005  181.910004  181.222336
2024-01-05   AAPL  181.990005  182.759995  180.169998  181.179993  180.495071
2024-01-08   AAPL  182.089996  185.600006  181.500000  185.559998  184.858521
...           ...         ...         ...         ...         ...         ...
2024-08-26   AAPL  226.759995  227.279999  223.889999  227.179993  227.179993
2024-08-27   AAPL  226.000000  228.850006  224.889999  228.029999  228.029999
2024-08-28   AAPL  227.919998  229.860001  225.679993  226.490005  226.490005
2024-08-29   AAPL  230.100006  232.919998  228.880005  229.789993  229.789993
2024-08-30   AAPL  230.190002  230.399994  227.479996  229.000000  229.000000

              Volume
Date
2024-01-02  82488700
2024-01-03  58414500
2024-01-04  71983600
2024-01-05  62303300
2024-01-08  59144500
...              ...
2024-08-26  30602200
2024-08-27  35934600
2024-08-28  38052200
2024-08-29  51906300
2024-08-30  52990800

[168 rows x 7 columns]
           Symbol        Open        High         Low       Close   Adj Close  \
Date
2024-01-02  GOOGL  138.550003  139.449997  136.479996  138.169998  137.828705
2024-01-03  GOOGL  137.250000  139.630005  137.080002  138.919998  138.576859
2024-01-04  GOOGL  138.419998  139.160004  136.350006  136.389999  136.053101
2024-01-05  GOOGL  136.750000  137.160004  135.149994  135.729996  135.394745
2024-01-08  GOOGL  136.289993  139.009995  136.259995  138.839996  138.497055
...           ...         ...         ...         ...         ...         ...
2024-08-26  GOOGL  166.380005  167.550003  164.460007  166.160004  165.939804
2024-08-27  GOOGL  165.839996  166.440002  164.460007  164.679993  164.461761
2024-08-28  GOOGL  165.039993  165.600006  161.529999  162.850006  162.634201
2024-08-29  GOOGL  164.309998  165.970001  160.250000  161.779999  161.565613
2024-08-30  GOOGL  162.619995  163.660004  161.690002  163.380005  163.163498

              Volume
Date
2024-01-02  23711200
2024-01-03  24212100
2024-01-04  27137700
2024-01-05  22506000
2024-01-08  21404000
...              ...
2024-08-26  14190400
2024-08-27  11821900
2024-08-28  16407400
2024-08-29  19699800
2024-08-30  22123800

[168 rows x 7 columns]

#### Question 4-2. Please concatenate the `Apple` and `Google` data index will consist of the Date column, which we will sort.

In [34]:
com_df = pd.concat([apple_41, google_41])
#com_df.set_index("Date", inplace = True)
com_df.sort_index(inplace = True)
com_df = com_df[['Symbol', 'Open', 'High', 'Low', 'Close', 'Adj Close', 'Volume']]
com_df

# concate_2024 =\
# (
#     pd
#     .concat(
#         [apple,
#          google]
#             )
#     .sort_index()
# )
# concate_2024.columns
# cols = ["Symbol", ......]

,Symbol,Open,High,Low,Close,Adj Close,Volume
Date,,,,,,,
2024-01-02,AAPL,187.149994,188.440002,183.889999,185.639999,184.938217,82488700
2024-01-02,GOOGL,138.550003,139.449997,136.479996,138.169998,137.828705,23711200
2024-01-03,GOOGL,137.250000,139.630005,137.080002,138.919998,138.576859,24212100
2024-01-03,AAPL,184.220001,185.880005,183.429993,184.250000,183.553482,58414500
2024-01-04,AAPL,182.149994,183.089996,180.880005,181.910004,181.222336,71983600
...,...,...,...,...,...,...,...
2024-08-28,AAPL,227.919998,229.860001,225.679993,226.490005,226.490005,38052200
2024-08-29,GOOGL,164.309998,165.970001,160.250000,161.779999,161.565613,19699800
2024-08-29,AAPL,230.100006,232.919998,228.880005,229.789993,229.789993,51906300
2024-08-30,AAPL,230.190002,230.399994,227.479996,229.000000,229.000000,52990800
2024-08-30,GOOGL,162.619995,163.660004,161.690002,163.380005,163.163498,22123800

#### Question 4-3. Please pushes the index into a column and resets to a default integer index.

In [40]:
com_df43 = com_df.head(5)
com_df43

,Date,Symbol,Open,High,Low,Close,Adj Close,Volume
0,2024-01-02,AAPL,187.149994,188.440002,183.889999,185.639999,184.938217,82488700
1,2024-01-02,GOOGL,138.550003,139.449997,136.479996,138.169998,137.828705,23711200
2,2024-01-03,GOOGL,137.250000,139.630005,137.080002,138.919998,138.576859,24212100
3,2024-01-03,AAPL,184.220001,185.880005,183.429993,184.250000,183.553482,58414500
4,2024-01-04,AAPL,182.149994,183.089996,180.880005,181.910004,181.222336,71983600

In [ ]:
# concate_2024.reset_index()

# concate_2024.head()

#### Question 4-4. Please pivot Date into the Index, make the columns match the unique values in the Symbol column, and the values will be the AdjClose values

In [41]:
#print(com_df.columns)
com_df = com_df.reset_index()
pivot_df = com_df.pivot(index='Date', columns='Symbol', values='Adj Close')
pivot_df

Symbol            AAPL       GOOGL
Date
2024-01-02  184.938217  137.828705
2024-01-03  183.553482  138.576859
2024-01-04  181.222336  136.053101
2024-01-05  180.495071  135.394745
2024-01-08  184.858521  138.497055
...                ...         ...
2024-08-26  227.179993  165.939804
2024-08-27  228.029999  164.461761
2024-08-28  226.490005  162.634201
2024-08-29  229.789993  161.565613
2024-08-30  229.000000  163.163498

[168 rows x 2 columns]

### Let's execute `stacking` and `unstacking`

### Question 5-1. Please stack the first level of columns into the index.

### Let's move AAPL and GOOGL into the index leaving a single colum which is the AdjClose values

In [ ]:
# pivot_df.head()

In [ ]:
# stacked_df =\
# (
#     pivot_df
#     .stack()
# )


#type(stacked_df)

In [45]:
stacked_df = pivot_df.stack()
print(stacked_df)

Date        Symbol
2024-01-02  AAPL      184.938217
            GOOGL     137.828705
2024-01-03  AAPL      183.553482
            GOOGL     138.576859
2024-01-04  AAPL      181.222336
                         ...
2024-08-28  GOOGL     162.634201
2024-08-29  AAPL      229.789993
            GOOGL     161.565613
2024-08-30  AAPL      229.000000
            GOOGL     163.163498
Length: 336, dtype: float64

> Using `.loc` we can retrieve close values by specifying both the date and ticker

In [62]:
stacked_df.name = "Adj Close"
df51 = stacked_df.reset_index()
df51.rename(columns={'level_1': 'Symbol'}, inplace=True)
df51.set_index(["Date", "Symbol"], inplace=True)
aapl_close = df51.loc[('2024-01-04', 'AAPL'), 'Adj Close']
aapl_close

np.float64(181.2223358154297)

#### Question 5-2. Please lookup on just the date, which will give us two values one each for AAPL and GOOGL.

In [ ]:
# stacked_df\
#     .loc[("2024-01-04", )
#         ]

> Let's have a look at all values for the GOOGL symbol

In [ ]:
# stacked_df\
#     .loc[:, "GOOGL"]

#### Question 5-3. Please pivot the last level of the index back into a column

### Now, let's do some `melting`

### Question 6-1. Please use `melt` to make id_vars of Date and Symbol, making the column names the variable and the for each the value

#### Question 6-2. Please extract the values for the data for Google on 2024-08-23

In [ ]:
# melted_df\
#     [(melted_df.Date == "2024-08-23") & (melted_df.Symbol == "GOOGL")]

### Let's do some grouping and aggregation

##### To do so, we will do some splitting first.

> Let's construct a DataFrame to demonstrate splitting

### Question 7-1. Please extract from combined the Symbol and AdjClose, and reset the index

In [ ]:
# concat_price =\
# (
#     concate_2024
#     [["Date", "Symbol", "Close"]]
# )

#### Question 7-2. Please add two columns, year and month, using the year and month portions of the data as integers

In [ ]:
# concat_price["Year"] =\
# (
#     concat_price
#     .Date
#     .dt
#     .year
# )

# order_of_columns = ["Date", "Year", "Symbol", "Adj Close"]

# concate_price = concat_price[order_of_columns]

# concat_price

> Let's group by the Symbol column

> Here, please save the result!

> The groupby object has a property groups, which shows how all rows will in mapped into the groups.

> The type of this object is a python dict

> Let's show the mappings of rows to groups

> Yes, this reports the number of groups that resulted from the grouping

### Question 8-1. Please create a function that prints the contents of a group. You might want to look at the outputs below for hints.

###  When you execute your function you should see the following results.

> .size will tell us the count of items in each group

#### Question 8-2. As you know, a specific group can be retrieved using .get_group() which returns a DataFrame representing the specified group. Please execute so that you can have the output below.

#### Question 8-3. Please group by three different fields (`Symbol`, `Year`, `Month`) and print the result

### Question 9-1. Let's set the index of the data to be the following three fields we are creating a multiindex

#### Question 9-2. Then, please group based upon values in the actual index the following groups by level 0 of the index (Month)

#### Question 9-3. Please group by three levels in the index using their names

### Now let's do something with a 2-D array of Dow Jones Industrial Average in 2008

The array `data_problem_sets_3.csv` is a 2-D array with each row holding the
daily performance of the Dow Jones Industrial Average from the
beginning of 2008 (dates have been removed for exercise simplicity).
The array has the following structure::

       OPEN      HIGH      LOW       CLOSE     VOLUME      ADJ_CLOSE
       13261.82  13338.23  12969.42  13043.96  3452650000  13043.96
       13044.12  13197.43  12968.44  13056.72  3429500000  13056.72
       13046.56  13049.65  12740.51  12800.18  4166000000  12800.18
       12801.15  12984.95  12640.44  12827.49  4221260000  12827.49
       12820.9   12998.11  12511.03  12589.07  4705390000  12589.07
       12590.21  12814.97  12431.53  12735.31  5351030000  12735.31

> Below you will find the necessary modules for the task.

In [ ]:
from numpy import loadtxt, sum, where

> Below are constants that indicate what data is held in each column of the `dow` array.

* OPEN = 0
* HIGH = 1
* LOW = 2
* CLOSE = 3
* VOLUME = 4
* ADJ_CLOSE = 5

> `data_problem_sets_3.csv` is our NumPy array that you will manipulate. Below you will find another way to load your csv file :)

In [ ]:
dow =\
    loadtxt("data_problem_sets_3.csv", 
            delimiter= ",")

dow

### Question 10-1. Please create a `mask` array that indicates which rows have a volume greater than 5.5 billion.

> Hint: The mask refers to boolean masking. How would you go about doing boolean masking? How will you apply the `mask` to the dataframe?

#### Question 10-2. How many are there?  (Please use print function to give your answer).

> Hint: Is there a way to incorporate variables within the print statement?

#### Question 10-3. Please find the index of every row (or day) where the volume is greater than 5.5.

> Hint: This is another case of boolean masking but in this case, applied to the index.

#### Question 10-4. Plot the adjusted close for EVERY day in 2008.

#### Question 10-5. Now over-plot this plot with a `red dot` marker for every day where the dow volume was greater than 5.5 billion.

### <font color="green">"Thank you for putting your efforts into the exercise problem sets ðŸ’¯"</font>